var submit = require('./fun.js');
var expect = require('chai').expect;
var input1 = "导师：张三\n" +
    "2016级博士生：天一、王二、吴五\n" +
    "2015级硕士生：李四、王五、许六\n" +
    "2016级硕士生：刘一、李二、李三\n" +
    "2017级本科生：刘六、琪七、司四\n" +
    "\n" +
    "刘六：JAVA、数学建模\n" +
    "\n" +
    "李二：字节跳动、京东云";
var result_teacher1 = {
    '张三': {
        '2016级博士生': [ '天一', '王二', '吴五' ],
        '2015级硕士生': [ '李四', '王五', '许六' ],
        '2016级硕士生': [ '刘一', '李二', '李三' ],
        '2017级本科生': [ '刘六', '琪七', '司四' ]
    }
};
var result_student1 = { '刘六': [ 'JAVA', '数学建模' ], '李二': [ '字节跳动', '京东云' ] };

var input2 = "导师：张三\n" +
    "2016级博士生：吴五\n" +
    "2015级硕士生：李四、王五、许六\n" +
    "2016级硕士生：刘一、李二、李三\n" +
    "\n" +
    "刘六：JAVA\n" +
    "\n" +
    "李二：字节跳动、京东云";
var result_teacher2 = {
    '张三': {
        '2016级博士生': [ '吴五' ],
        '2015级硕士生': [ '李四', '王五', '许六' ],
        '2016级硕士生': [ '刘一', '李二', '李三' ]
    }
};
var result_student2 = { '刘六': [ 'JAVA' ], '李二': [ '字节跳动', '京东云' ] };

var input3 = "导师：张三\n" +
    "2016级博士生：天一、王二、吴五\n" +
    "2015级硕士生：李四、王五、许六\n" +
    "2016级硕士生：刘一、李二、李三\n" +
    "2017级本科生：刘六、琪七、司四\n" +
    "\n" +
    "刘六：JAVA、数学建模\n" +
    "\n" +
    "李二：字节跳动、京东云"+
    "\n" +
    "导师：张三丰\n" +
    "2016级博士生：天一、王二、吴五\n" +
    "2015级硕士生：李四、王五、许六\n" +
    "2016级硕士生：刘一、李二、李三\n" +
    "2017级本科生：刘六、琪七、司四\n" +
    "\n" +
    "刘六：JAVA、数学建模\n" +
    "\n" +
    "李二：字节跳动、京东云";
var result_teacher3 = {
    '张三': {
        '2016级博士生': [ '天一', '王二', '吴五' ],
        '2015级硕士生': [ '李四', '王五', '许六' ],
        '2016级硕士生': [ '刘一', '李二', '李三' ],
        '2017级本科生': [ '刘六', '琪七', '司四' ]
    },
    '张三丰': {
        '2016级博士生': [ '天一', '王二', '吴五' ],
        '2015级硕士生': [ '李四', '王五', '许六' ],
        '2016级硕士生': [ '刘一', '李二', '李三' ],
        '2017级本科生': [ '刘六', '琪七', '司四' ]
    }
};
var result_student3 = { '刘六': [ 'JAVA', '数学建模' ], '李二': [ '字节跳动', '京东云' ] };


var input4 = "导师：张三\n" +
    "2016级博士生：天一、王二、吴五\n" +
    "2015级硕士生：李四、王五、许六\n" +
    "2016级硕士生：刘一、李二、李三\n" +
    "2017级本科生：刘六、琪七、司四\n" +
    "\n" +
    "刘六：JAVA、数学建模\n" +
    "\n" +
    "李二：字节跳动、京东云"+
    "\n"+
    "导师：张三\n" +
    "2016级博士生：天一、王二、吴五\n" +
    "2015级硕士生：李四、王五、许六\n" +
    "2016级硕士生：刘一、李二、李三\n" +
    "2017级本科生：龙王\n" +
    "\n" +
    "刘六：JAVA、数学建模\n" +
    "\n" +
    "李二：字节跳动、京东云";
var result_teacher4 = {
    '张三': {
        '2016级博士生': [ '天一', '王二', '吴五' ],
        '2015级硕士生': [ '李四', '王五', '许六' ],
        '2016级硕士生': [ '刘一', '李二', '李三' ],
        '2017级本科生': [ '刘六', '琪七', '司四' ,'龙王']
    }
};
var result_student4 = { '刘六': [ 'JAVA', '数学建模' ], '李二': [ '字节跳动', '京东云' ] };

var input5 = "导师：张三\n" +
    "2016级博士生：天一、王二、吴五\n" +
    "2015级硕士生：李四、王五、许六\n" +
    "2016级硕士生：刘一、李二、李三\n" +
    "2017级本科生：刘六、琪七、司四\n" +
    "刘六：JAVA、数学建模\n" +
    "\n" +
    "李二：字节跳动、京东云";
var result_teacher5 = {
    '张三': {
        '2016级博士生': [ '天一', '王二', '吴五' ],
        '2015级硕士生': [ '李四', '王五', '许六' ],
        '2016级硕士生': [ '刘一', '李二', '李三' ],
        '2017级本科生': [ '刘六', '琪七', '司四' ]
    }
};
var result_student5 = {};

var input6 = "导师：张三\n" +
    "\n"+
    "2016级博士生：天一、王二、吴五\n" +
    "2015级硕士生：李四、王五、许六\n" +
    "2016级硕士生：刘一、李二、李三\n" +
    "2017级本科生：刘六、琪七、司四\n" +
    "\n" +
    "刘六：JAVA、数学建模\n" +
    "\n" +
    "李二：字节跳动、京东云";
var result_teacher6 = {
    '张三': {
        '2016级博士生': [ '天一', '王二', '吴五' ],
        '2015级硕士生': [ '李四', '王五', '许六' ],
        '2016级硕士生': [ '刘一', '李二', '李三' ],
        '2017级本科生': [ '刘六', '琪七', '司四' ]
    }
};
var result_student6 = { '刘六': [ 'JAVA', '数学建模' ], '李二': [ '字节跳动', '京东云' ] };



describe('文本处理函数测试1（标准输入）', function() {
    it('函数处理文本后得到的结果和正确结果相一致', function() {
        expect(submit(input1,result_teacher1,result_student1)).to.be.equal(1);
    });
});

describe('文本处理函数测试2（标准输入）', function() {
    it('函数处理文本后得到的结果和正确结果相一致', function() {
        expect(submit(input2,result_teacher2,result_student2)).to.be.equal(1);
    });
});

describe('文本处理函数测试3（多组标准输入,每组的导师不同）', function() {
    it('函数处理文本后得到的结果和正确结果相一致', function() {
        expect(submit(input3,result_teacher3,result_student3)).to.be.equal(1);
    });
});


describe('文本处理函数测试4(多组标准输入，每组的导师相同)', function() {
    it('函数处理文本后得到的结果和正确结果相一致', function() {
        expect(submit(input4,result_teacher4,result_student4)).to.be.equal(1);
    });
});

describe('文本处理函数测试5(输入错误格式的文本:人员信息和技能树之间没有空行)', function() {
    it('函数处理文本后得到的结果和正确结果相一致', function() {
        expect(submit(input5,result_teacher5,result_student5)).to.be.equal(1);
    });
});

describe('文本处理函数测试6(输入错误格式的文本:导师信息和各级学生信息之间多了空行)', function() {
    it('函数处理文本后得到的结果和正确结果相一致', function() {
        expect(submit(input6,result_teacher6,result_student6)).to.be.equal(1);
    });
});
